/*********************************************************************
...运算符展开数组
...arr 返回一个解压的数组。 也就是说，它展开数组。 然而，展开操作符只能够在函数的参数中或者数组中使用。 
下面的代码将会报错：
const spreaded = ...arr;
**********************************************************************/
//求一个数组的最大值
// const arr = [6, 89, 3, 15];
// const maximus = Math.max(...arr);
// console.log(maximus);

// sum 函数可以接收任意数量的参数，并返回它们的总和。
// const sum = (...args) => {
// 	return args.reduce((a, b) => a+b, 0);
// }
// console.log(sum(6, 2, 3));

// sum 函数可以接收任意数量的参数，并返回它们的乘积。
// const sum = (...args) => {
// 	return args.reduce((a, b) => a*b, 1);
// }
// console.log(sum(6, 2, 3));
